12/data/attachments/c7e339b79a9cc7aa.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_e2dbedb2-ec48-4fa8-8c35-cf9412fe4ee9</nif:username>
            <nif:friendToBeAdded>Amber_cause_Actions_25580_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>